*** crates/oauth-as/src/authorization.rs:102:17: delete match arm "code_challenge" in AuthorizationRequest<'a>::from_pairs

*** mutation diff:
--- crates/oauth-as/src/authorization.rs
+++ delete match arm "code_challenge" in AuthorizationRequest<'a>::from_pairs
@@ -94,17 +94,17 @@
         let mut req = AuthorizationRequest::default();
         for (k, v) in pairs {
             let slot = match k.as_ref() {
                 "response_type" => &mut req.response_type,
                 "client_id" => &mut req.client_id,
                 "redirect_uri" => &mut req.redirect_uri,
                 "scope" => &mut req.scope,
                 "state" => &mut req.state,
-                "code_challenge" => &mut req.code_challenge,
+                 /* ~ changed by cargo-mutants ~ */
                 "code_challenge_method" => &mut req.code_challenge_method,
                 _ => continue,
             };
             if slot.is_none() {
                 *slot = Some(v.into());
             }
         }
         req


