*** crates/oauth-as/src/authorization.rs:94:9: replace AuthorizationRequest<'a>::from_pairs -> Self with Default::default()

*** mutation diff:
--- crates/oauth-as/src/authorization.rs
+++ replace AuthorizationRequest<'a>::from_pairs -> Self with Default::default()
@@ -86,33 +86,17 @@
     /// and last-wins is the smuggling-friendly choice when two intermediaries disagree about
     /// which copy counts.
     pub fn from_pairs<I, K, V>(pairs: I) -> Self
     where
         I: IntoIterator<Item = (K, V)>,
         K: AsRef<str>,
         V: Into<Cow<'a, str>>,
     {
-        let mut req = AuthorizationRequest::default();
-        for (k, v) in pairs {
-            let slot = match k.as_ref() {
-                "response_type" => &mut req.response_type,
-                "client_id" => &mut req.client_id,
-                "redirect_uri" => &mut req.redirect_uri,
-                "scope" => &mut req.scope,
-                "state" => &mut req.state,
-                "code_challenge" => &mut req.code_challenge,
-                "code_challenge_method" => &mut req.code_challenge_method,
-                _ => continue,
-            };
-            if slot.is_none() {
-                *slot = Some(v.into());
-            }
-        }
-        req
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A request that has passed validation: the client exists, is allowed this grant, the redirect
 /// URI is one of its registrations, and the PKCE parameters are well formed.
 ///
 /// The data fields stay `pub` for read access (state, ergonomics, and the smallest diff over the
 /// existing call sites in `tests/authorization_code.rs`, none of which construct this type by

---- zero_cost_efficiency_gates stdout ----

thread 'zero_cost_efficiency_gates' (20451171) panicked at crates/oauth-as/tests/allocation.rs:265:5:
assertion `left == right` failed
  left: None
 right: Some("public-app")

thread 'zero_cost_efficiency_gates' (20451171) panicked at crates/oauth-as/tests/allocation.rs:128:5:
1 of 12 efficiency gate(s) failed:
authorization_request_from_borrowed_pairs_allocates_nothing: assertion `left == right` failed
  left: None
 right: Some("public-app")

failures:
    zero_cost_efficiency_gates

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
