*** crates/oauth-as/src/authorization.rs:97:17: delete match arm "response_type" in AuthorizationRequest<'a>::from_pairs

*** mutation diff:
--- crates/oauth-as/src/authorization.rs
+++ delete match arm "response_type" in AuthorizationRequest<'a>::from_pairs
@@ -89,17 +89,17 @@
     where
         I: IntoIterator<Item = (K, V)>,
         K: AsRef<str>,
         V: Into<Cow<'a, str>>,
     {
         let mut req = AuthorizationRequest::default();
         for (k, v) in pairs {
             let slot = match k.as_ref() {
-                "response_type" => &mut req.response_type,
+                 /* ~ changed by cargo-mutants ~ */
                 "client_id" => &mut req.client_id,
                 "redirect_uri" => &mut req.redirect_uri,
                 "scope" => &mut req.scope,
                 "state" => &mut req.state,
                 "code_challenge" => &mut req.code_challenge,
                 "code_challenge_method" => &mut req.code_challenge_method,
                 _ => continue,
             };

---- every_defined_parameter_is_collected stdout ----

thread 'every_defined_parameter_is_collected' (20454900) panicked at crates/oauth-as/tests/authorization_request_parsing.rs:33:5:
assertion `left == right` failed
  left: None
 right: Some("code")

---- unknown_parameters_are_ignored stdout ----

thread 'unknown_parameters_are_ignored' (20454903) panicked at crates/oauth-as/tests/authorization_request_parsing.rs:57:5:
assertion `left == right` failed
  left: None
 right: Some("code")

failures:
    every_defined_parameter_is_collected
    unknown_parameters_are_ignored

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
