*** crates/oauth-as/src/authorization.rs:98:17: delete match arm "client_id" in AuthorizationRequest<'a>::from_pairs

*** mutation diff:
--- crates/oauth-as/src/authorization.rs
+++ delete match arm "client_id" in AuthorizationRequest<'a>::from_pairs
@@ -90,17 +90,17 @@
         I: IntoIterator<Item = (K, V)>,
         K: AsRef<str>,
         V: Into<Cow<'a, str>>,
     {
         let mut req = AuthorizationRequest::default();
         for (k, v) in pairs {
             let slot = match k.as_ref() {
                 "response_type" => &mut req.response_type,
-                "client_id" => &mut req.client_id,
+                 /* ~ changed by cargo-mutants ~ */
                 "redirect_uri" => &mut req.redirect_uri,
                 "scope" => &mut req.scope,
                 "state" => &mut req.state,
                 "code_challenge" => &mut req.code_challenge,
                 "code_challenge_method" => &mut req.code_challenge_method,
                 _ => continue,
             };
             if slot.is_none() {

---- zero_cost_efficiency_gates stdout ----

thread 'zero_cost_efficiency_gates' (20459037) panicked at crates/oauth-as/tests/allocation.rs:265:5:
assertion `left == right` failed
  left: None
 right: Some("public-app")

thread 'zero_cost_efficiency_gates' (20459037) panicked at crates/oauth-as/tests/allocation.rs:128:5:
1 of 12 efficiency gate(s) failed:
authorization_request_from_borrowed_pairs_allocates_nothing: assertion `left == right` failed
  left: None
 right: Some("public-app")

failures:
    zero_cost_efficiency_gates

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
