*** crates/oauth-as/src/authorization.rs:99:17: delete match arm "redirect_uri" in AuthorizationRequest<'a>::from_pairs

*** mutation diff:
--- crates/oauth-as/src/authorization.rs
+++ delete match arm "redirect_uri" in AuthorizationRequest<'a>::from_pairs
@@ -91,17 +91,17 @@
         K: AsRef<str>,
         V: Into<Cow<'a, str>>,
     {
         let mut req = AuthorizationRequest::default();
         for (k, v) in pairs {
             let slot = match k.as_ref() {
                 "response_type" => &mut req.response_type,
                 "client_id" => &mut req.client_id,
-                "redirect_uri" => &mut req.redirect_uri,
+                 /* ~ changed by cargo-mutants ~ */
                 "scope" => &mut req.scope,
                 "state" => &mut req.state,
                 "code_challenge" => &mut req.code_challenge,
                 "code_challenge_method" => &mut req.code_challenge_method,
                 _ => continue,
             };
             if slot.is_none() {
                 *slot = Some(v.into());


